app/Controllers/AdminController.php

SELECT *
FROM `categories`
---
    public function addCategory()
{
    $categoryModel = new CategoryModel();

    // Validate input
    $validation = \Config\Services::validation();
    $validation->setRules([
        'name' => 'required|min_length[3]|max_length[255]',
        'description' => 'required|min_length[5]'
    ]);

    if (!$this->validate($validation->getRules())) {
        // Validation failed
        return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
    }

    // Insert category into the database
    $data = [
        'name' => $this->request->getPost('name'),
        'description' => $this->request->getPost('description'),
    ];

    if ($categoryModel->insert($data)) {
        // Success: Redirect with success message
        return redirect()->to('/admin/categories')->with('success', 'Category added successfully!');

SELECT *
FROM `users`
WHERE `users`.`user_id` = '21'
---
    public function updateProfile()
{
    $session = session();
    $userModel = new UserModel();
    $otpModel = new OtpModel();

    // Check if user is logged in and has the admin role
    if (!$session->get('logged_in') || $session->get('role') !== 'admin') {
        return redirect()->to('/')->with('error', 'Access denied.');
    }

    $user_id = $session->get('user_id');
    $data = $this->request->getPost();

    // Get current user data
    $currentUser = $userModel->find($user_id);

UPDATE `users` SET `firstname` = 'Mervin', `lastname` = 'Babiano', `updated_at` = '2024-11-19 20:05:50'
WHERE `users`.`user_id` IN ('21')
---
    }

    // Update the user profile
    if ($userModel->update($user_id, $data)) {

SELECT *
FROM `books`
---
    public function dashboard()
    {
        $session = session();

        // Ensure the user is logged in
        if (!$session->get('logged_in')) {
            return redirect()->to('/login');
        }

        // Check if the user has the admin role
        if ($session->get('role') !== 'admin') {
            return redirect()->to('/user/dashboard');
        }

        // Fetch all books from the BookModel
        $bookModel = new BookModel();
        $data['books'] = $bookModel->findAll();  // Get all books

SELECT *
FROM `categories`
---
    public function addBook()
    {
        // Check if the user is logged in and has the required role/permissions
        if (!session()->has('logged_in') || session()->get('role') !== 'admin') {
            // Redirect to an unauthorized page or show a warning
            return view('errors/unauthorized'); // Create this view to show an unauthorized message
        }

        // Fetch categories from the database
        $categoryModel = new CategoryModel();
        $categories = $categoryModel->findAll();

SELECT *
FROM `books`
WHERE `books`.`book_id` = '21'
---
    public function updateBookDetails()
    {
        $bookModel = new BookModel();

        // Collect updated data
        $book_id = $this->request->getPost('book_id');
        $title = $this->request->getPost('title');
        $isbn = $this->request->getPost('isbn');  // Still get the ISBN but won't validate if unchanged

        // If the title is updated, proceed to validate it
        $validationRules = [
            'title' => 'required|min_length[3]|max_length[255]',
        ];

        // Get existing book data to compare ISBN
        $existingBookData = $bookModel->find($book_id);

UPDATE `books` SET `title` = 'Diary Ng Panget', `isbn` = '9789710573653', `author` = 'HaveYouSeenThisGirL', `published_date` = '2014-04-02', `status` = 'available', `description` = 'A poor, self-described ugly girl takes a job as a personal maid for a rich, handsome young man. The two don\'t get along, but as they get tangled in their classmates\' games of affection, their relationship becomes more complicated.', `category_id` = '14', `updated_at` = '2024-11-19 20:04:47'
WHERE `books`.`book_id` IN ('21')
---
        }

        // Update the book record
        if ($bookModel->update($book_id, $data)) {

SELECT *
FROM `books`
---
public function viewBooks()
    {

        // Check if the user is logged in and has the required role/permissions
    if (!session()->has('logged_in') || session()->get('role') !== 'admin') {
        // Redirect to an unauthorized page or show a warning
        return view('errors/unauthorized'); // Create this view to show an unauthorized message
    }
        $bookModel = new BookModel();

        // Fetch all books
        $books = $bookModel->findAll();