app/Controllers/AdminController.php

SELECT *
FROM `users`
---
    public function viewUsers()
    {

        $userModel = new \App\Models\UserModel();


        $users = $userModel->findAll();

SELECT *
FROM `categories`
---
    public function categories()
    {
        $categoryModel = new \App\Models\CategoryModel();
        $data['categories'] = $categoryModel->findAll(); // Fetch all categories from the database

SELECT *
FROM `books`
---
    public function dashboard()
    {
        $session = session();


        if (!$session->get('logged_in')) {
            return redirect()->to('/login');
        }


        if ($session->get('role') !== 'admin') {
            return redirect()->to('/user/dashboard');
        }


        $bookModel = new BookModel();
        $data['books'] = $bookModel->findAll();  // Get all books