app/Controllers/TransactionController.php

public function returnBook()
{
    $session = session();
    if (!$session->get('logged_in') || $session->get('role') != 'student') {
        return redirect()->to('/');
    }

    $transaction_id = $this->request->getVar('transaction_id');
    $transaction = $this->transactionModel->find($transaction_id);

    if ($transaction['status'] != 'borrowed') {
        return $this->response->setJSON(['status' => 'error', 'message' => 'Invalid transaction']);
    }

    // Get the current date (return date) and due date for comparison
    $return_date = date('Y-m-d');
    $due_date = $transaction['due_date'];

    // Determine if the return is late or on time
    $remarks = (strtotime($return_date) > strtotime($due_date)) ? 'Late' : 'On time';

    // Update transaction with return date, status, and remarks
    $this->transactionModel->update($transaction_id, [
        'return_date' => $return_date,
        'status' => 'returned',
        'remarks' => $remarks // Update the remarks field
    ]);

    // Update the book status to available
    $this->bookModel->update($transaction['book_id'], ['status' => 'available']);
---
SELECT *
FROM `transactions`
WHERE `transactions`.`transaction_id` = '18'
UPDATE `books` SET `status` = 'available', `updated_at` = '2024-11-19 10:23:43'
WHERE `books`.`book_id` IN ('15')