app/Controllers/UserController.php

    public function dashboard()
    {
        $session = session();
        if (!$session->get('logged_in')) {
            return redirect()->to('/login');
        }

        if ($session->get('role') == 'admin') {
            return redirect()->to('/admin/dashboard');
        } else {
            // Load available books for students
            $bookModel = new BookModel();
            $data['books'] = $bookModel->where('status', 'available')->findAll();
---
SELECT *
FROM `books`
WHERE `status` = 'available'

    public function getBookDetails()
{
    $book_id = $this->request->getGet('book_id');

    if (!$book_id) {
        return $this->response->setJSON(['error' => 'Book ID is required']);
    }

    // Load necessary models
    $bookModel = new BookModel();
    $transactionModel = new TransactionModel();

    // Get book details
    $book = $bookModel->find($book_id);
    if (!$book) {
        return $this->response->setJSON(['error' => 'Book not found']);
    }

    // Get the borrow history for the book
    $history = $transactionModel->select('users.firstname, users.lastname, transactions.borrow_date')
                                ->join('users', 'users.user_id = transactions.user_id')
                                ->where('transactions.book_id', $book_id)
                                ->orderBy('transactions.borrow_date', 'DESC') // Sorting by borrow date in descending order
                                ->findAll();
---
SELECT *
FROM `books`
WHERE `books`.`book_id` = '29'
SELECT `users`.`firstname`, `users`.`lastname`, `transactions`.`borrow_date`
FROM `transactions`
JOIN `users` ON `users`.`user_id` = `transactions`.`user_id`
WHERE `transactions`.`book_id` = '29'
ORDER BY `transactions`.`borrow_date` DESC